# GetExportPatternTable Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseExportOptions..::..GetExportPatternTable Method
BaseExportOptions Class See Also
---
Gets a copy of the pattern table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportPatternTable GetExportPatternTable()
```

Visual Basic
---
```text
Public Function GetExportPatternTable As ExportPatternTable
```

Visual C++
---
```text
public:
ExportPatternTable^ GetExportPatternTable()
```

# ### Return Value
The pattern table.
# See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace